{
    "experiences": [
        {
            "dates": "01/2025 ‐ present",
            "company": "Millicom | Tigo",
            "url": "https://www.millicom.com/",
            "title": "Head of Data Analytics - Digital",
            "location": "Panamá, PA",
            "bullets": [
                "Lidero el modelado, análisis y centralización de datos del ecosistema digital (App MiTigo, TigoSports, TigoTV, TigoChat, Pasarelas de Pago, Liza, Supermarket, Add Ons, Ookla, Braze) en 9 países para ~50M de usuarios.",
                "Soy responsable de la eficiencia y disponibilidad de analítica en la nube (AWS, GCP, Azure, Snowflake), habilitando soluciones compartidas, SSOT y KPIs cross-country.",
                "Dirijo laboratorio de Agentes de IA y analítica avanzada (RAG, LLMs, ML) para optimizar operaciones telco y generación de insights automatizados.",
                "Orquesto gobierno de datos digitales, calidad y maestros de clientes, asegurando trazabilidad y consistencia entre productos y países.",
                "Gestiono control de costos cloud, tuning de workloads y disponibilidad de datos para analítica descriptiva y predictiva."
            ]            
        },
        {
            "dates": "08/2023 ‐ 12/2024",
            "company": "Millicom | Tigo",
            "url": "https://www.millicom.com/",
            "title": "Head of Data - MFS",
            "location": "Panamá, PA",
            "bullets": [
                "Lideré la estrategia de datos regional para Tigo Money (6 países), consolidando arquitectura analítica, modelos, procesos de calidad y costos cloud.",
                "Implementé framework para Lending Risk, Fraud Detection, Customer Insights y reporting regulatorio, asegurando cumplimiento y eficiencia.",
                "Sincronicé SSOT financiero regional con senior management, mejorando data accuracy, quality y velocidad de reporting.",
                "Conseguí reducciones de costos anuales de data mediante optimización de pipelines, almacenamiento y consumo analítico."
            ]            
        },
        {
            "dates": "12/2021 ‐ 07/2023",
            "company": "Millicom | Tigo",
            "url": "https://www.millicom.com/",
            "title": "Head of Customer Intelligence - Tigo Money",
            "location": "Panamá, PA",
            "bullets": [
                "Diseñé e implementé fuentes y modelos de datos para marketing y crecimiento de usuarios en 6 países (segmentación, SSOT, dashboards).",
                "Habilité customer behavior analytics que impulsó 3.5x en engagement (de 2 a 7 trx por usuario) con ML y analítica de campañas.",
                "Desarrollé marcos de medición digital y automatización para revenue management y customer engagement, optimizando costos y churn.",
                "Construí tableros para usuarios, churn y rentabilidad, y modelos predictivos para upselling/cross-selling basados en propensión."
            ]            
        },        
        {
            "dates": "11/2019 ‐ 11/2021",
            "company": "El Comercio News & Media Group",
            "url": "https://grupoelcomercio.com.pe/",
            "title": "Manager of Data & Analytics",
            "location": "Lima, PE",
            "bullets": [
                "Lideré la estrategia de Data Governance y monetización de audiencias; analítica centralizada en 8 marcas y migración del data lake a la nube.",
                "Construí MDM para datos zero/first-party; consolidé 23 silos en una SSOT y estandaricé dashboards (QlikView → PowerBI)."
            ]
        },
        {
            "dates": "11/2016 ‐ 10/2019",
            "company": "Telefonica | Movistar",
            "url": "https://telefonica.com.pe/",
            "title": "Manager of Customer Intelligence",
            "location": "Lima, PE",
            "bullets": [
                "Lideré Customer 360 Intelligence para 17M de usuarios; establecí hub unificado y SSOT a través de múltiples touchpoints.",
                "Desarrollé dashboards ejecutivos; implementé el primer modelo de text mining para sentimiento en chatbots y analytics de fraude."
            ]
        },
        {
            "dates": "02/2013 ‐ 03/2016",
            "company": "Telefónica | Movistar",
            "url": "https://telefonica.com.pe/",
            "title": "Senior Executive in Marketing Analytics",
            "location": "Lima, PE",
            "bullets": [
                "Especialista en analítica de marketing y modelamiento estadístico para optimización de campañas y segmentación.",
                "Desarrollé modelos de atribución y marketing mix; implementé dashboards en R Shiny y estrategias basadas en clustering."
            ]
        },
        {
            "dates": "12/2010 ‐ 01/2013",
            "company": "Telefónica | Movistar",
            "url": "https://telefonica.com.pe/",
            "title": "Campaign and Performance Analyst",
            "location": "Lima, PE",
            "bullets": [
                "Analítica end-to-end para portafolio digital prepago; desarrollé metodologías de tracking de conversión.",
                "Automaticé reportes, reduciendo 50% el trabajo manual y estandarizando la medición de performance."
            ]
        },
        {
            "dates": "08/2009 ‐ 11/2010",
            "company": "Telefónica | Movistar",
            "url": "https://telefonica.com.pe/",
            "title": "Market Research Intern",
            "location": "Lima, PE",
            "bullets": [
                "Automaticé flujos de procesamiento de encuestas (insights en el mismo día) y realicé análisis estadísticos en SPSS.",
                "Entregué insights cualitativos de focus groups para informar decisiones de desarrollo de productos."
            ]
        },
        {
            "dates": "03/2016 ‐ 08/2016",
            "company": "Universidad Nacional de Ingenieria",
            "url": "https://portal.uni.edu.pe/",
            "title": "Professor of Applied Computational Statistics",
            "location": "Lima, PE",
            "bullets": [
                "Diseñé y ejecuté un currículo con casos empresariales reales y proyectos de análisis de datos, conectando teoría y práctica.",
                "Mentoricé estudiantes en rutas académicas y de carrera en data science y estadística; varios lograron prácticas y roles en empresas top."
            ]
        }        
    ]
}